Tekla Open API Reference for Tekla Structures 2025
RadiusDimension Properties
The RadiusDimension type exposes the following members.
Properties
Name | Description
ArcPoint1
 Gets the first arc point.
ArcPoint2
 Gets the second arc point.
ArcPoint3
 Gets the third arc point.
Attributes
 The radius dimension attributes.
Distance
 Gets or sets the distance.
Hideable
 Accesses the information if this object is hidden or not or if it should be.
 (Inherited from DimensionBase.)
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
Top
See Also
Reference
RadiusDimension Class
Tekla.Structures.Drawing Namespace